# 11.
# б) Дани два текстових файли f і g з однаковою кількістю рядків. Визначити чи
# співпадають рядки двох файлів. Якщо ні, то отримати номер першого рядка, в якому ці
# файли відрізняютсья один від одного.
# Сугак Даниїл Васильович 1 курс група 122Б
l_f = []
l_g = []
with open('f.txt', 'r') as f:
    for line in f:
        l_f.append(line)
with open('g.txt', 'r') as g:
    for line in g:
        l_g.append(line)
s = True
for i in range(len(l_f)):
    if l_f[i] != l_g[i]:
        s = False
        print(f"номер першого рядка, в якому ці файли відрізняютсья один від одного: {i+1}")
        break
if s:
    print("рядки співпадають")