# 30. Обчислити середнє арифметичне значення тих елементів одновимірного
# масиву, які розташовані за першим по порядку мінімальним елементом.
import numpy as np
import random

size = random.randint(1, 100)
# size = 10
print(f"size: {size}")
a = np.random.randint(0, 100, size)
print(f"Вхідний масив: {a}")

a = a[(np.where(a == a.min()))[0][0]::]
print(
    f"середнє арифметичне значення тих елементів одновимірного масиву, які розташовані за першим по порядку мінімальним елементом: {np.average(a)}")
