# 34. Дано два лінійних масиву однакової розмірності. Скласти третій масив з
# добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.

import numpy as np

a = np.random.randint(-100, 100, 20)
b = np.random.randint(-100, 100, 20)
print(f"Вхідний масив a: {a}")
print(f"Вхідний масив b: {b}")
c = a*b
print(f"Вихідний масив b: {c}")
