# 38. Дані про направлення вітру (північний, південний, східний, західний) і
# силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
# південний вітер з силою, що перевищує 8 м / с.
import numpy as np

direction = np.array(
    ["північний", "південний", "східний", "західний", "південний", "східний", "західний", "північний", "південний",
     "східний"])
speed = np.array(
    [5, 9, 10, 2, 3, 18, 3, 4, 5, 8])
# together = np.array([direction, speed])
# print(together)
days = 0
for i in range(min(len(direction), len(speed))):
    if direction[i] == "південний" and speed[i] > 8:
        days += 1
print(f"Кільуість днів, коли дув південний вітер з силою, що перевищує 8 м / с: {days}")
