# 48. Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
# місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
# з початку і третього від кінця і т.д.

table = ["Геркулес", "Аполлон", "Промитей", "Одисей", "Тесей", "Персей", "Ахил", "Артеміда", "Ванша","Вано"]
# table[0], table[1], table[2] = table[-1], table[-2], table[-3]
# ['Вано', 'Ванша', 'Артеміда', 'Одисей', 'Тесей', 'Персей', 'Ахил', 'Артеміда', 'Ванша', 'Вано']

# l = len(table)
# for i in range(0, l // 2):
#     table[i], table[-i - 1] = table[-i - 1], table[i]
#     print(i)
table.reverse()
print(table)