# 55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
# мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
# і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
import numpy as np

kvartiri = np.random.randint(0, 10, 30)
print(f"Квартири: {kvartiri}")
count = kvartiri[kvartiri>5]
kvartiri = kvartiri[::-1]
print(f"Квартири після переселення: {kvartiri}")
print(f"Ккількість квартир, в яких проживає більше 5 осіб: {len(count)}")
