# 57. Відомість на зарплату представлена як дві таблиці. Одна містить
# прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
# працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
# працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
# заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
# зарплата якого мінімальна.
import numpy as np
import math

table = ["Геркулес", "Аполлон", "Промитей", "Одисей", "Тесей", "Персей", "Ахил", "Артеміда", "Ванша", "Вано"]
salary = [12, 14, 24, 12, 52, 34, 12, 754, 12, 745]
t = np.array(table)
s = np.array(salary)
s2 = np.array(salary)
av = np.average(s)
m = 0
idx = 0
for i in range(len(salary)):
    if math.fabs(av - salary[i]) < m:
        m = math.fabs(av - salary[i])
        idx = i
print(
    f"Прізвище працівника, зарплата якого найменш відхиляється від середньої зарплати всіх працівників за поточний місяць: {table[idx]}")
first = (np.where(s2 == s2.max()))[0][0]
s2[first] = s2.min()
second = (np.where(s2 == s2.max()))[0][0]
print(
    f"Прізвища двох працівників з найбільшою заробітною платою: {table[first], table[second]}")

last = (np.where(s == s.min()))[0][0]
s = np.delete(s, last)
t = np.delete(t, last)
print(t)
print(s)
